Masmiseim36/nxpSDK/devices/MIMXRT1181/drivers/fsl_tpm.c
        /* 
         * According to ERR008068, if writing Channel(n) Value register (TPMx_CnV) more than once when the timer
         * counter is disabled, and writes occur at a frequency faster than the TPM asynchronous clock, the registers
         * may not update correctly.
         * This issue occurs when the register is written an even number of times but does not appear when the register
         * is written an odd number of times.
         * Use do...while loop to ensure modulo register is updated.
         */
        do
        {
#if TPM_TIMEOUT
            if (timeout-- == 0U)
            {
                return kStatus_Timeout;
            }
#endif
            base->CONTROLS[chnlId].CnV = cnv;
            /*
             * $Branch Coverage Justification$
             * (cnv != base->CONTROLS[chnlId].CnV) not covered. $ref tpm_c_ref_1$.
             */
        } while (cnv != base->CONTROLS[chnlId].CnV);

#if defined(FSL_FEATURE_TPM_HAS_COMBINE) && FSL_FEATURE_TPM_HAS_COMBINE
    }
#endif
    return kStatus_Success;
}

/*!
 * brief Configures the PWM signal parameters
 *
 * User calls this function to configure the PWM signals period, mode, dutycycle and edge. Use this
 * function to configure all the TPM channels that will be used to output a PWM signal
 *
 * param base        TPM peripheral base address
 * param chnlParams  Array of PWM channel parameters to configure the channel(s)
 * param numOfChnls  Number of channels to configure, this should be the size of the array passed in
 * param mode        PWM operation mode, options available in enumeration ::tpm_pwm_mode_t
 * param pwmFreq_Hz  PWM signal frequency in Hz
 * param srcClock_Hz TPM counter clock in Hz
 *
 * return kStatus_Success PWM setup successful
 *        kStatus_Error   PWM setup failed
 *        kStatus_Timeout PWM setup timeout when write register CnV or MOD
 */
status_t TPM_SetupPwm(TPM_Type *base,
                      const tpm_chnl_pwm_signal_param_t *chnlParams,
                      uint8_t numOfChnls,
                      tpm_pwm_mode_t mode,
                      uint32_t pwmFreq_Hz,
                      uint32_t srcClock_Hz)
{
    assert(NULL != chnlParams);

    uint32_t mod        = 0U;
    uint32_t counterMax = TPM_MAX_COUNTER_VALUE(base);
    uint32_t tpmClock   = (srcClock_Hz / (1UL << (base->SC & TPM_SC_PS_MASK)));
    status_t status     = kStatus_Success;
#if TPM_TIMEOUT
    uint32_t timeout = TPM_TIMEOUT;
#endif

    if ((0U == pwmFreq_Hz) || (0U == srcClock_Hz) || (0U == numOfChnls) || (tpmClock < pwmFreq_Hz))
    {
        return kStatus_InvalidArgument;
    }

    switch (mode)
    {
#if defined(FSL_FEATURE_TPM_HAS_COMBINE) && FSL_FEATURE_TPM_HAS_COMBINE
        case kTPM_CombinedPwm:
#endif
        case kTPM_EdgeAlignedPwm:
            base->SC &= ~TPM_SC_CPWMS_MASK;
            mod = (tpmClock / pwmFreq_Hz) - 1U;

            /*
             * $Branch Coverage Justification$
             * (mod > counterMax) not covered. $ref tpm_c_tpm_3$.
             */
            if ((mod > counterMax) || (mod == 0U))
            {
                /*  The MOD greater than the maximum allowed (some instanse only support 16-bit counter) or smaller than
                1, probably would require changing clock source to get the desired frequency. */
                status = kStatus_OutOfRange;
            }
            break;
        case kTPM_CenterAlignedPwm:
            base->SC |= TPM_SC_CPWMS_MASK;
            mod = tpmClock / (pwmFreq_Hz * 2u);
            /*
             * $Branch Coverage Justification$
             * (mod > counterMax >> 1U) not covered. $ref tpm_c_tpm_3$.
             */
            if ((mod > (counterMax >> 1U)) || (mod == 0U))
            {
                /* MOD values have additional requirements under center-aligned MODE, it must be kept in the range
                 * of 0x1 ~ 0x7FFF (under 16-bit counter). */
                status = kStatus_OutOfRange;
            }
            break;
        default:
            /* All the cease have been listed above, the default case should not be reached. */
            status = kStatus_InvalidArgument;
            break;
    }
    if (kStatus_Success != status)
    {
        return status;
    }

    /* Set the PWM period */
    /* 
     * According to ERR008068, if writing the modulo register (TPMx_MOD) more than once when the timer counter is
     * disabled, and writes occur at a frequency faster than the TPM asynchronous clock, the registers may not 
     * update correctly.
     * This issue occurs when the register is written an even number of times but does not appear when the register
     * is written an odd number of times.
     * Use do...while loop to ensure modulo register is updated.
     */
    do
    {
        base->MOD = mod;
#if TPM_TIMEOUT
        if (timeout-- == 0U)
        {
            return kStatus_Timeout;
        }
#endif
        /*
         * $Branch Coverage Justification$
         * (mod != base->MOD) not covered. $ref tpm_c_ref_5$.
         */
    } while (mod != base->MOD);

    /* Setup each TPM channel */
    for (uint8_t i = 0; i < numOfChnls; i++)
    {
        /* Setup a single PWM channel */
        status = TPM_SetupSinglePwmChannel(base, mod, mode, *chnlParams);
        if (status != kStatus_Success)
        {
            return status;
        }
        chnlParams++;
    }

#if defined(FSL_FEATURE_TPM_HAS_QDCTRL) && FSL_FEATURE_TPM_HAS_QDCTRL
    /* The TPM's QDCTRL register required to be effective */
    if (1U == (uint8_t)FSL_FEATURE_TPM_QDCTRL_HAS_EFFECTn(base))
    {
        /* Clear quadrature Decoder mode because in quadrature Decoder mode PWM doesn't operate*/
        base->QDCTRL &= ~TPM_QDCTRL_QUADEN_MASK;
    }
#endif

    return kStatus_Success;
}

/*!
 * brief Update the duty cycle of an active PWM signal
 *
 * param base              TPM peripheral base address
 * param chnlNumber        The channel number. In combined mode, this represents
 *                          the channel pair number
 * param currentPwmMode    The current PWM mode set during PWM setup
 * param dutyCyclePercent  New PWM pulse width, value should be between 0 to 100
 *                          0=inactive signal(0% duty cycle)...
 *                          100=active signal (100% duty cycle)
 * return kStatus_Success PWM setup successful
 *        kStatus_Error   PWM setup failed
 *        kStatus_Timeout PWM setup timeout when write register CnV
 */
status_t TPM_UpdatePwmDutycycle(TPM_Type *base,
                                tpm_chnl_t chnlNumber,
                                tpm_pwm_mode_t currentPwmMode,
                                uint8_t dutyCyclePercent)
{
    uint32_t cnv, mod;
    uint32_t counterMax = TPM_MAX_COUNTER_VALUE(base);
    uint8_t chnlId      = (uint8_t)chnlNumber;
#if TPM_TIMEOUT
    uint32_t timeout = TPM_TIMEOUT;
#endif

